In [287]:
import pandas as pd
import numpy as np

In [288]:

from sklearn.metrics import pairwise_distances

In [289]:
rating = pd.read_csv("D:\\DataSet\\Recomedation System\\ml-latest-small\\ml-latest-small\\ratings.csv")
rating.drop(['timestamp'],axis=1,inplace=True)
rating.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [290]:
len(rating['userId'].unique())

610

In [291]:
len(rating['movieId'].unique())

9724

In [292]:
user_movie = rating.pivot(index='userId',columns='movieId',values='rating')

user_movie.head()

movieId,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
userId,,,,,,,,,,,,,,,,,,,,,
1,4.0,NaN,4.0,NaN,NaN,4.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [293]:
user_movie.fillna(value=0,inplace=True)

In [294]:
user_movie.head()

movieId,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
userId,,,,,,,,,,,,,,,,,,,,,
1,4.0,0.0,4.0,0.0,0.0,4.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,4.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [295]:
user_sim = 1 - pairwise_distances(user_movie.values,metric='cosine')

user_sim_df = pd.DataFrame(user_sim)

user_sim_df.index = rating.userId.unique()
user_sim_df.columns = rating.userId.unique()

In [296]:
user_sim_df.head()

,1,2,3,4,5,6,7,8,9,10,...,601,602,603,604,605,606,607,608,609,610
1,1.000000,0.027283,0.059720,0.194395,0.129080,0.128152,0.158744,0.136968,0.064263,0.016875,...,0.080554,0.164455,0.221486,0.070669,0.153625,0.164191,0.269389,0.291097,0.093572,0.145321
2,0.027283,1.000000,0.000000,0.003726,0.016614,0.025333,0.027585,0.027257,0.000000,0.067445,...,0.202671,0.016866,0.011997,0.000000,0.000000,0.028429,0.012948,0.046211,0.027565,0.102427
3,0.059720,0.000000,1.000000,0.002251,0.005020,0.003936,0.000000,0.004941,0.000000,0.000000,...,0.005048,0.004892,0.024992,0.000000,0.010694,0.012993,0.019247,0.021128,0.000000,0.032119
4,0.194395,0.003726,0.002251,1.000000,0.128659,0.088491,0.115120,0.062969,0.011361,0.031163,...,0.085938,0.128273,0.307973,0.052985,0.084584,0.200395,0.131746,0.149858,0.032198,0.107683
5,0.129080,0.016614,0.005020,0.128659,1.000000,0.300349,0.108342,0.429075,0.000000,0.030611,...,0.068048,0.418747,0.110148,0.258773,0.148758,0.106435,0.152866,0.135535,0.261232,0.060792

In [297]:
np.fill_diagonal(user_sim,val=0)

In [298]:
user_sim_df.head()

,1,2,3,4,5,6,7,8,9,10,...,601,602,603,604,605,606,607,608,609,610
1,0.000000,0.027283,0.059720,0.194395,0.129080,0.128152,0.158744,0.136968,0.064263,0.016875,...,0.080554,0.164455,0.221486,0.070669,0.153625,0.164191,0.269389,0.291097,0.093572,0.145321
2,0.027283,0.000000,0.000000,0.003726,0.016614,0.025333,0.027585,0.027257,0.000000,0.067445,...,0.202671,0.016866,0.011997,0.000000,0.000000,0.028429,0.012948,0.046211,0.027565,0.102427
3,0.059720,0.000000,0.000000,0.002251,0.005020,0.003936,0.000000,0.004941,0.000000,0.000000,...,0.005048,0.004892,0.024992,0.000000,0.010694,0.012993,0.019247,0.021128,0.000000,0.032119
4,0.194395,0.003726,0.002251,0.000000,0.128659,0.088491,0.115120,0.062969,0.011361,0.031163,...,0.085938,0.128273,0.307973,0.052985,0.084584,0.200395,0.131746,0.149858,0.032198,0.107683
5,0.129080,0.016614,0.005020,0.128659,0.000000,0.300349,0.108342,0.429075,0.000000,0.030611,...,0.068048,0.418747,0.110148,0.258773,0.148758,0.106435,0.152866,0.135535,0.261232,0.060792

In [299]:
user_sim_df.idxmax(axis=1)[0:5]

1    266
2    366
3    313
4    391
5    470
dtype: int64

In [300]:
user_sim_df.iloc[0:1,265:269]

        266      267       268       269
1  0.357408  0.16354  0.153292  0.083464

In [301]:
movies = pd.read_csv("D:\DataSet\Recomedation System\ml-latest-small\ml-latest-small\movies.csv")
#movies.drop(['genres'],axis=1,inplace=True)

<>:1: SyntaxWarning: invalid escape sequence '\D'
<>:1: SyntaxWarning: invalid escape sequence '\D'
C:\Users\Debjit\AppData\Local\Temp\ipykernel_12112\342609756.py:1: SyntaxWarning: invalid escape sequence '\D'
  movies = pd.read_csv("D:\DataSet\Recomedation System\ml-latest-small\ml-latest-small\movies.csv")

In [302]:
movies.head(100)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
95,107,Muppet Treasure Island (1996),Adventure|Children|Comedy|Musical
96,108,Catwalk (1996),Documentary
97,110,Braveheart (1995),Action|Drama|War
98,111,Taxi Driver (1976),Crime|Drama|Thriller
99,112,Rumble in the Bronx (Hont faan kui) (1995),Action|Adventure|Comedy|Crime

In [303]:
def get_user_similer_movies(user1,user2):
    common_movies = rating[rating.userId == user1].merge(rating[rating.userId==user2],how='inner',on='movieId')
    return common_movies.merge(movies,on='movieId')

In [304]:
common_movies = get_user_similer_movies(2,366)

In [305]:
common_movies[(common_movies.rating_x >=4) & (common_movies.rating_y>=4)]

,userId_x,movieId,rating_x,userId_y,rating_y,title,genres
0,2,3578,4.0,366,4.5,Gladiator (2000),Action|Adventure|Drama
1,2,6874,4.0,366,4.0,Kill Bill: Vol. 1 (2003),Action|Crime|Thriller
2,2,48516,4.0,366,4.5,"Departed, The (2006)",Crime|Drama|Thriller
3,2,58559,4.5,366,4.0,"Dark Knight, The (2008)",Action|Crime|Drama|IMAX
4,2,68157,4.5,366,4.5,Inglourious Basterds (2009),Action|Drama|War
5,2,79132,4.0,366,4.0,Inception (2010),Action|Crime|Drama|Mystery|Sci-Fi|Thriller|IMAX

In [306]:
movie_user = rating.pivot(index = 'movieId',columns='userId',values='rating').reset_index(drop=True)

In [307]:
movie_user.fillna(value=0,inplace=True)

In [308]:
movie_sim = 1 - pairwise_distances(movie_user,metric='correlation',n_jobs=-1)
movie_sim_df = pd.DataFrame(movie_sim)

movie_sim_df.index = movie_user.index
movie_sim_df.columns = movie_user.index

In [309]:
movie_sim_df.iloc[0:5,0:5]

          0         1         2         3         4
0  1.000000  0.231327  0.173213 -0.028917  0.192474
1  0.231327  1.000000  0.191945  0.071269  0.200526
2  0.173213  0.191945  1.000000  0.067143  0.370171
3 -0.028917  0.071269  0.067143  1.000000  0.167910
4  0.192474  0.200526  0.370171  0.167910  1.000000

In [310]:
def get_similer_movies(movieid,nTop = 5):
    movieIdx = movies[movies.movieId == movieid].index
    if len(movieIdx) == 0:
        print('movie not found')
        return 
    else:
        movieIdx = movieIdx[0]
    movies['similarity'] = movie_sim_df.iloc[movieIdx]
    ntop = movies.sort_values(['similarity'],ascending=False)[0:nTop]
    return ntop['title'].values

In [311]:
get_similer_movies(2)

array(['Jumanji (1995)', 'Lion King, The (1994)', 'Mrs. Doubtfire (1993)',
       'Mask, The (1994)', 'Nightmare Before Christmas, The (1993)'],
      dtype=object)

In [312]:
def low(x):
    return x.lower()

In [313]:
movies['title'] = movies['title'].apply(low)

In [314]:
def check(x):
    title = movies[['title']]
    n = title.size
    for i in range(n):
        movie_name = title.iloc[i].values[0]
        movie_name = movie_name.lower()
        x = x.lower()
        if x in movie_name:
            movie_id = movies['movieId'].iloc[i]
            return True,movie_id
    return False,0

In [315]:
rating.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [316]:
movies = movies.merge(rating.groupby('movieId').mean()[['rating']],on='movieId',how='inner')

In [317]:
movies.head()

,movieId,title,genres,similarity,rating
0,1,toy story (1995),Adventure|Animation|Children|Comedy|Fantasy,0.231327,3.920930
1,2,jumanji (1995),Adventure|Children|Fantasy,1.000000,3.431818
2,3,grumpier old men (1995),Comedy|Romance,0.191945,3.259615
3,4,waiting to exhale (1995),Comedy|Drama|Romance,0.071269,2.357143
4,5,father of the bride part ii (1995),Comedy,0.200526,3.071429

In [318]:
movies['genres'].values

array(['Adventure|Animation|Children|Comedy|Fantasy',
       'Adventure|Children|Fantasy', 'Comedy|Romance', ..., 'Drama',
       'Action|Animation', 'Comedy'], shape=(9724,), dtype=object)

In [319]:
def name(x):
    name = x.split(' ')
    year = name[-1]
    name.pop()
    return ' '.join(name)

In [320]:
def get_year(x):
    return x.split(' ')[-1]

In [321]:
year = []
for i in range(movies['title'].size):
    year.append(get_year(movies['title'].iloc[i]))

movies['Year'] = pd.DataFrame(year)

In [322]:
movies['title'] = movies['title'].apply(name)

In [324]:
movies.head(100)

,movieId,title,genres,similarity,rating,Year
0,1,toy story,Adventure|Animation|Children|Comedy|Fantasy,0.231327,3.920930,(1995)
1,2,jumanji,Adventure|Children|Fantasy,1.000000,3.431818,(1995)
2,3,grumpier old men,Comedy|Romance,0.191945,3.259615,(1995)
3,4,waiting to exhale,Comedy|Drama|Romance,0.071269,2.357143,(1995)
4,5,father of the bride part ii,Comedy,0.200526,3.071429,(1995)
...,...,...,...,...,...,...
95,107,muppet treasure island,Adventure|Children|Comedy|Musical,0.181165,3.326923,(1996)
96,108,catwalk,Documentary,-0.018291,4.000000,(1996)
97,110,braveheart,Action|Drama|War,0.228898,4.031646,(1995)
98,111,taxi driver,Crime|Drama|Thriller,0.074523,4.105769,(1976)
99,112,rumble in the bronx (hont faan kui),Action|Adventure|Comedy|Crime,0.095773,3.543478,(1995)